// Модуль 5. Заняття 11. Прототипи та класи

// =>
// 1. Створити список технологій, що вивчаються на курсі Fullstack за допомогою js.
// Показати як це робиться через map та reduce

// const technologies = ["HTML", "CSS", "JavaScript", "React", "Node"];

// =>
// 2. Створити кілька кнопок на основі масива з обєктами використовуючи createElement.

//  const colors = [
//    {
//      label: "red",
//      color: "#FF0000",
//    },
//    {
//      label: "green",
//      color: "#00FF00",
//    },
//    {
//      label: "blue",
//      color: "#0000FF",
//    },
//    {
//      label: "yellow",
//      color: "#FFFF00",
//    },
//  ];

// =>
// 3. Створити сайт з такою розміткою використовуючи лише JS в html файлі має бути пусто
