//
// Модуль 9 - Заняття 17 - Таймери та час

// =>
// 1. Робота з setTimeout.
// Напишіть функцію showNotification(message, duration),
// яка відображає повідомлення на сторінці на деякий час duration мілісекунд,
// а потім приховує його.
// Наприклад, при виклику showNotification('Hello, world!', 3000),
// на сторінці з'явиться повідомлення "Hello, world!" на 3 секунди,
// а потім автоматично зникне.
// При кліку на хрестик, повідомлення закривається швидше.

// =>
// 1. Робота з датами та setTimeout.
// Напишіть функцію updateCurrency(),
// яка буде виводити ціну долара в залежності від часу.
// Дані зберігаються в масиві usdToUah та datesOfChange.
// Вивід має змінуватись кожну секунду і повинен бути циклічним.
// FORMAT: "2021 March Friday (12)                      27.15 UAH"
// const usdToUah = [
//   27.95, 27.9, 27.78, 27.65, 27.15, 26.99, 27.2, 26.98, 26.57, 26.53,
// ];
// const datesOfChange = [
//   new Date("2021-03-12"),
//   new Date("2021-04-28"),
//   new Date("2021-05-12"),
//   new Date("2021-06-04"),
//   new Date("2021-07-01"),
//   new Date("2021-08-24"),
//   new Date("2021-09-23"),
//   new Date("2021-10-05"),
//   new Date("2021-11-01"),
//   new Date("2021-12-09"),
// ];
