//
//

// Модуль 11 - Заняття 21 - CRUD
// 1. UsersServer
// Створити кастомний сервер на UI стороні за домогою класу.
// За допомогою нього створити запити на CRUD операції, а саме:
//  * Стягнути всіх користувачів із псевдо-сервера;
//  * Видалити користувача із псевдо-сервера;
//  * Оновити користувача на псевдо-сервері;
//  * Створити користувача на псевдо-сервері.
// Все має працювати асинхронно за допомогою промісів;
// Користувачі мають зберігатись в localStorage,
// щоб створити ілюзію реального сервера з валідаціями.
// Псевдо-сервер має працювати аналогічно, як і функція fetch.
// ** Якщо залишиться час, добавити до класу функціонал, який буде виводити
//    в консоль інформацію, якщо щось загружається в даний момент.
// ******
// ПС - псевдо-сервер
// Допомога і кроки для виконання:
// 1. Написати кастомний json, string (аналог response.json());
// 2. Написати в ПС статичні посилання;
// 3. Зберігати у ПС змінну user(get, set), підтримувати stroge;
// 4. Написати для ПС функцію fetch;
// 5. Написати switch case для перевірки method (GET, POST, PUT, DELETE);
// 6. Написати для ПС функції get та post -> put, delete за необхідністю;
// 7. Написати логіку пагінацій та отримання відповіді за допогою Promise для:
//      * GET; *POST; *PUT; *DELETE;

// class UsersServer {}
