// Модуль 6. Заняття 12. Події

// =>
// 1. Створити модальне вікно,
// яке буде відкриватися при кліку на кнопку всередині тега body.
// Модальне вікно має закриватися при кліку на напівпрозорий оверлей
// та на іконку хрестика модального вікна.

// =>
// 2. Додати в модалку логіку закриття при натисканні на кнопку Escape

// =>
// 3. Створити форму реєстрації користувача за допомогою js, де буде 2 поля:
//     * Поле логін;
//     * Поле пароль.
// Не забудьте додати кнопку "Submit".
// Вірні логін і пароль зберігаються в константах;

// 3.1 Додати логіку підтвердження форми.
// При натисканні на кнопку "Submit" перевіряємо введені логін і пароль:
//     * Якщо логін і пароль співпадають,
// то переходимо на нову сторінку веб-сайту (тобто видаляємо все з документа)
// і показуємо <h2> з написом "Вхід успішний";
//     * Якщо логін і пароль не вірні,
// то показуємо під формою текст <p> червоним кольором "Логін або пароль не вірні".
